In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# start with a vanilla series
wflow1 = pd.Series(["Ingesting data",
                    "Describing data",
                    "Assessing data utility",
                    "Designing and building refined data",
                    "Ad hoc reporting",
                    "Exploratory modeling and forecasting",
                    "Designing and building optimized data",
                    "Regular reporting",
                    "Building products and services"])

In [3]:
wflow1

0                           Ingesting data
1                          Describing data
2                   Assessing data utility
3      Designing and building refined data
4                         Ad hoc reporting
5     Exploratory modeling and forecasting
6    Designing and building optimized data
7                        Regular reporting
8           Building products and services
dtype: object

In [4]:
# now let's try an indexed series
wflow2 = pd.Series(["Ingesting data",
                    "Describing data",
                    "Assessing data utility",
                    "Designing and building refined data",
                    "Ad hoc reporting",
                    "Exploratory modeling and forecasting",
                    "Designing and building optimized data",
                    "Regular reporting",
                    "Building products and services"],
            index = ['Raw1','Raw2','Raw3','Refi1','Refi2','Refi3','Prod1','Prod2','Prod3'])

In [5]:
wflow2

Raw1                            Ingesting data
Raw2                           Describing data
Raw3                    Assessing data utility
Refi1      Designing and building refined data
Refi2                         Ad hoc reporting
Refi3     Exploratory modeling and forecasting
Prod1    Designing and building optimized data
Prod2                        Regular reporting
Prod3           Building products and services
dtype: object

In [6]:
# BTW, notice that Series indexing starts at 0, not 1
wflow1[8]

'Building products and services'

In [7]:
wflow2[8]

'Building products and services'

In [8]:
wflow2['Prod3']

'Building products and services'

In [9]:
wflow1[3:6]

3     Designing and building refined data
4                        Ad hoc reporting
5    Exploratory modeling and forecasting
dtype: object

In [10]:
wflow2[['Refi1','Refi2','Refi3']]

Refi1     Designing and building refined data
Refi2                        Ad hoc reporting
Refi3    Exploratory modeling and forecasting
dtype: object

In [11]:
wflow1.str.contains('data')

0     True
1     True
2     True
3     True
4    False
5    False
6     True
7    False
8    False
dtype: bool

In [12]:
wflow1[wflow1.str.contains('data')]

0                           Ingesting data
1                          Describing data
2                   Assessing data utility
3      Designing and building refined data
6    Designing and building optimized data
dtype: object

In [13]:
wflow1[wflow1.str.contains('data') == False]

4                        Ad hoc reporting
5    Exploratory modeling and forecasting
7                       Regular reporting
8          Building products and services
dtype: object

In [14]:
wflow1.str.replace('data', 'stuff')

0                           Ingesting stuff
1                          Describing stuff
2                   Assessing stuff utility
3      Designing and building refined stuff
4                          Ad hoc reporting
5      Exploratory modeling and forecasting
6    Designing and building optimized stuff
7                         Regular reporting
8            Building products and services
dtype: object

In [15]:
# remember that Python is a functional language
wflow1

0                           Ingesting data
1                          Describing data
2                   Assessing data utility
3      Designing and building refined data
4                         Ad hoc reporting
5     Exploratory modeling and forecasting
6    Designing and building optimized data
7                        Regular reporting
8           Building products and services
dtype: object

In [16]:
# before going on, let's note a few extra things about numeric series
# (an example of which we'll generate using a Python "list comprehension")
nums = pd.Series([float(i) for i in np.arange(1,5)])

In [17]:
nums

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [18]:
nums * 3

0     3.0
1     6.0
2     9.0
3    12.0
dtype: float64

In [19]:
nums < 3

0     True
1     True
2    False
3    False
dtype: bool

In [20]:
nums[nums >= 3]

2    3.0
3    4.0
dtype: float64

In [21]:
# let's also take a quick look at null-handling in a Series
nums[2] = np.nan

In [22]:
nums

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [23]:
nums[nums >= 3]

3    4.0
dtype: float64

In [24]:
nums[nums < 3]

0    1.0
1    2.0
dtype: float64

In [25]:
nums[nums.isnull()]

2   NaN
dtype: float64

In [26]:
nums.dropna()

0    1.0
1    2.0
3    4.0
dtype: float64

In [27]:
# now let's look at dataframes (~= collection of Series sharing an index)
# first let's populate a dataframe by reading a CSV file
sailors = pd.read_csv("/Users/mikejcarey/Desktop/teaching/STATS170ab/Sailors.csv")

FileNotFoundError: File b'/Users/mikejcarey/Desktop/teaching/STATS170ab/Sailors.csv' does not exist

In [28]:
!cat /Users/mikejcarey/Desktop/teaching/STATS170ab/Sailors.csv

cat: /Users/mikejcarey/Desktop/teaching/STATS170ab/Sailors.csv: No such file or directory

In [29]:
sailors

NameError: name 'sailors' is not defined

In [30]:
sailors.info()

NameError: name 'sailors' is not defined

In [31]:
sailors.dtypes

sid         int64
sname      object
rating    float64
age       float64
major      object
dtype: object

In [32]:
sailors.describe()

              sid     rating        age
count   12.000000  11.000000  11.000000
mean    64.083333   6.363636  36.727273
std     30.010478   3.107176  13.583747
min     22.000000   1.000000  16.000000
25%     31.750000   3.500000  29.250000
50%     67.500000   7.000000  35.000000
75%     87.500000   8.500000  40.000000
max    107.000000  10.000000  63.500000

In [33]:
# now let's populate a dataframe by reading a JSON file
boats = pd.read_json("/Users/mikejcarey/Desktop/teaching/STATS170ab/Boats.json", lines='true')

In [34]:
!cat /Users/mikejcarey/Desktop/teaching/STATS170ab/Boats.json

{"bid": 101, "bname": "Interlake", "color": "blue"}
{"bid": 102, "bname": "Interlake", "color": "red"}
{"bid": 103, "bname": "Clipper", "color": "green"}
{"bid": 104, "bname": "Marine", "color": "red"}

In [35]:
boats

   bid      bname  color
0  101  Interlake   blue
1  102  Interlake    red
2  103    Clipper  green
3  104     Marine    red

In [36]:
boats.describe()

              bid
count    4.000000
mean   102.500000
std      1.290994
min    101.000000
25%    101.750000
50%    102.500000
75%    103.250000
max    104.000000

In [37]:
# now let's populate a dataframe by querying a backend database (PostgreSQL)
import sqlalchemy

In [38]:
from sqlalchemy import create_engine
engine = create_engine('postgresql+psycopg2://mikejcarey:postquel@localhost/mikejcarey')

In [39]:
reserves = pd.read_sql_query('SELECT * from reserves',con=engine)

In [40]:
reserves

     sid    bid        date
0   22.0  101.0  1998-10-10
1   22.0  102.0  1998-10-10
2   22.0  103.0  1998-10-08
3   22.0  104.0  1998-10-07
4   31.0  102.0  1998-10-11
5   31.0  103.0  1998-11-06
6   31.0  104.0  1998-11-12
7   64.0  101.0  1998-09-05
8   64.0  102.0  1998-09-02
9   74.0  103.0  1993-09-08
10   NaN  103.0  1998-09-09
11   1.0    NaN  2001-01-11
12   1.0    NaN  2002-02-02

In [41]:
reserves.describe()

             sid         bid
count  12.000000   11.000000
mean   32.083333  102.545455
std    23.619939    1.035725
min     1.000000  101.000000
25%    22.000000  102.000000
50%    26.500000  103.000000
75%    39.250000  103.000000
max    74.000000  104.000000

In [42]:
# now let's start working with our Wisconsin Sailing Club dataframes
sailors

    sid     sname  rating   age  major
0    22    Dustin     7.0  45.0     CS
1    29    Brutus     1.0  33.0     EE
2    31    Lubber     8.0  55.5   Econ
3    32      Andy     8.0  25.5   Math
4    58     Rusty    10.0  35.0     CS
5    64   Horatio     7.0  35.0     CS
6    71     Zorba    10.0  16.0     CS
7    74   Horatio     9.0  35.0   Math
8    85       Art     4.0  25.5  Music
9    95       Bob     3.0  63.5   Econ
10  101      Joan     3.0   NaN   Math
11  107  Johannes     NaN  35.0    NaN

In [43]:
sailors.head()

   sid   sname  rating   age major
0   22  Dustin     7.0  45.0    CS
1   29  Brutus     1.0  33.0    EE
2   31  Lubber     8.0  55.5  Econ
3   32    Andy     8.0  25.5  Math
4   58   Rusty    10.0  35.0    CS

In [44]:
sailors.tail(2)

    sid     sname  rating   age major
10  101      Joan     3.0   NaN  Math
11  107  Johannes     NaN  35.0   NaN

In [45]:
sailors[10:12]

    sid     sname  rating   age major
10  101      Joan     3.0   NaN  Math
11  107  Johannes     NaN  35.0   NaN

In [46]:
sailors[-2:]

    sid     sname  rating   age major
10  101      Joan     3.0   NaN  Math
11  107  Johannes     NaN  35.0   NaN

In [47]:
# we can do relational-style projection
sailors['sname']

0       Dustin
1       Brutus
2       Lubber
3         Andy
4        Rusty
5      Horatio
6        Zorba
7      Horatio
8          Art
9          Bob
10        Joan
11    Johannes
Name: sname, dtype: object

In [48]:
sailors[['sname','rating']]

       sname  rating
0     Dustin     7.0
1     Brutus     1.0
2     Lubber     8.0
3       Andy     8.0
4      Rusty    10.0
5    Horatio     7.0
6      Zorba    10.0
7    Horatio     9.0
8        Art     4.0
9        Bob     3.0
10      Joan     3.0
11  Johannes     NaN

In [49]:
# we can do relational-style selection
sailors[sailors.age < 30.0]

   sid  sname  rating   age  major
3   32   Andy     8.0  25.5   Math
6   71  Zorba    10.0  16.0     CS
8   85    Art     4.0  25.5  Music

In [50]:
sailors.age

0     45.0
1     33.0
2     55.5
3     25.5
4     35.0
5     35.0
6     16.0
7     35.0
8     25.5
9     63.5
10     NaN
11    35.0
Name: age, dtype: float64

In [51]:
sailors.age < 30.0

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8      True
9     False
10    False
11    False
Name: age, dtype: bool

In [52]:
sailors[sailors.age < 30.0]

   sid  sname  rating   age  major
3   32   Andy     8.0  25.5   Math
6   71  Zorba    10.0  16.0     CS
8   85    Art     4.0  25.5  Music

In [53]:
sailors[(sailors.major == 'CS') | (sailors.major == 'EE')]

   sid    sname  rating   age major
0   22   Dustin     7.0  45.0    CS
1   29   Brutus     1.0  33.0    EE
4   58    Rusty    10.0  35.0    CS
5   64  Horatio     7.0  35.0    CS
6   71    Zorba    10.0  16.0    CS

In [54]:
sailors[(sailors.major == 'CS') & (sailors.rating >= 8.0)]

   sid  sname  rating   age major
4   58  Rusty    10.0  35.0    CS
6   71  Zorba    10.0  16.0    CS

In [55]:
# Pandas supports indexing based on data values if you want
sailors.set_index('sid', inplace=True)

In [56]:
sailors

        sname  rating   age  major
sid
22     Dustin     7.0  45.0     CS
29     Brutus     1.0  33.0     EE
31     Lubber     8.0  55.5   Econ
32       Andy     8.0  25.5   Math
58      Rusty    10.0  35.0     CS
64    Horatio     7.0  35.0     CS
71      Zorba    10.0  16.0     CS
74    Horatio     9.0  35.0   Math
85        Art     4.0  25.5  Music
95        Bob     3.0  63.5   Econ
101      Joan     3.0   NaN   Math
107  Johannes     NaN  35.0    NaN

In [57]:
sailors['sname']

sid
22       Dustin
29       Brutus
31       Lubber
32         Andy
58        Rusty
64      Horatio
71        Zorba
74      Horatio
85          Art
95          Bob
101        Joan
107    Johannes
Name: sname, dtype: object

In [58]:
sailors.iloc[2]

sname     Lubber
rating         8
age         55.5
major       Econ
Name: 31, dtype: object

In [59]:
sailors.loc[31]

sname     Lubber
rating         8
age         55.5
major       Econ
Name: 31, dtype: object

In [60]:
sailors.loc[[32,64]]

       sname  rating   age major
sid
32      Andy     8.0  25.5  Math
64   Horatio     7.0  35.0    CS

In [61]:
# I'm not a fan, so let's put things back the way they were
sailors.reset_index(inplace=True)

In [62]:
sailors

    sid     sname  rating   age  major
0    22    Dustin     7.0  45.0     CS
1    29    Brutus     1.0  33.0     EE
2    31    Lubber     8.0  55.5   Econ
3    32      Andy     8.0  25.5   Math
4    58     Rusty    10.0  35.0     CS
5    64   Horatio     7.0  35.0     CS
6    71     Zorba    10.0  16.0     CS
7    74   Horatio     9.0  35.0   Math
8    85       Art     4.0  25.5  Music
9    95       Bob     3.0  63.5   Econ
10  101      Joan     3.0   NaN   Math
11  107  Johannes     NaN  35.0    NaN

In [63]:
# we can also do relational-style joins
pd.merge(reserves, boats, on='bid')

     sid    bid        date      bname  color
0   22.0  101.0  1998-10-10  Interlake   blue
1   64.0  101.0  1998-09-05  Interlake   blue
2   22.0  102.0  1998-10-10  Interlake    red
3   31.0  102.0  1998-10-11  Interlake    red
4   64.0  102.0  1998-09-02  Interlake    red
5   22.0  103.0  1998-10-08    Clipper  green
6   31.0  103.0  1998-11-06    Clipper  green
7   74.0  103.0  1993-09-08    Clipper  green
8    NaN  103.0  1998-09-09    Clipper  green
9   22.0  104.0  1998-10-07     Marine    red
10  31.0  104.0  1998-11-12     Marine    red

In [64]:
pd.merge(reserves, boats, left_on='bid', right_on='bid')

     sid    bid        date      bname  color
0   22.0  101.0  1998-10-10  Interlake   blue
1   64.0  101.0  1998-09-05  Interlake   blue
2   22.0  102.0  1998-10-10  Interlake    red
3   31.0  102.0  1998-10-11  Interlake    red
4   64.0  102.0  1998-09-02  Interlake    red
5   22.0  103.0  1998-10-08    Clipper  green
6   31.0  103.0  1998-11-06    Clipper  green
7   74.0  103.0  1993-09-08    Clipper  green
8    NaN  103.0  1998-09-09    Clipper  green
9   22.0  104.0  1998-10-07     Marine    red
10  31.0  104.0  1998-11-12     Marine    red

In [65]:
# relational-style joins can be inner joins (the default) or outer joins (left, right, outer)
pd.merge(sailors, reserves, on='sid', how='left')

    sid     sname  rating   age  major    bid        date
0    22    Dustin     7.0  45.0     CS  101.0  1998-10-10
1    22    Dustin     7.0  45.0     CS  102.0  1998-10-10
2    22    Dustin     7.0  45.0     CS  103.0  1998-10-08
3    22    Dustin     7.0  45.0     CS  104.0  1998-10-07
4    29    Brutus     1.0  33.0     EE    NaN         NaN
5    31    Lubber     8.0  55.5   Econ  102.0  1998-10-11
6    31    Lubber     8.0  55.5   Econ  103.0  1998-11-06
7    31    Lubber     8.0  55.5   Econ  104.0  1998-11-12
8    32      Andy     8.0  25.5   Math    NaN         NaN
9    58     Rusty    10.0  35.0     CS    NaN         NaN
10   64   Horatio     7.0  35.0     CS  101.0  1998-09-05
11   64   Horatio     7.0  35.0     CS  102.0  1998-09-02
12   71     Zorba    10.0  16.0     CS    NaN         NaN
13   74   Horatio     9.0  35.0   Math  103.0  1993-09-08
14   85       Art     4.0  25.5  Music    NaN         NaN
15   95       Bob     3.0  63.5   Econ    NaN         NaN
16  101      Joan     3.0   NaN   Math    NaN         NaN
17  107  Johannes     NaN  35.0    NaN    NaN         NaN

In [66]:
pd.merge(sailors, reserves, left_on='sid', right_on='sid', how='outer')

      sid     sname  rating   age  major    bid        date
0    22.0    Dustin     7.0  45.0     CS  101.0  1998-10-10
1    22.0    Dustin     7.0  45.0     CS  102.0  1998-10-10
2    22.0    Dustin     7.0  45.0     CS  103.0  1998-10-08
3    22.0    Dustin     7.0  45.0     CS  104.0  1998-10-07
4    29.0    Brutus     1.0  33.0     EE    NaN         NaN
5    31.0    Lubber     8.0  55.5   Econ  102.0  1998-10-11
6    31.0    Lubber     8.0  55.5   Econ  103.0  1998-11-06
7    31.0    Lubber     8.0  55.5   Econ  104.0  1998-11-12
8    32.0      Andy     8.0  25.5   Math    NaN         NaN
9    58.0     Rusty    10.0  35.0     CS    NaN         NaN
10   64.0   Horatio     7.0  35.0     CS  101.0  1998-09-05
11   64.0   Horatio     7.0  35.0     CS  102.0  1998-09-02
12   71.0     Zorba    10.0  16.0     CS    NaN         NaN
13   74.0   Horatio     9.0  35.0   Math  103.0  1993-09-08
14   85.0       Art     4.0  25.5  Music    NaN         NaN
15   95.0       Bob     3.0  63.5   Econ    NaN         NaN
16  101.0      Joan     3.0   NaN   Math    NaN         NaN
17  107.0  Johannes     NaN  35.0    NaN    NaN         NaN
18    NaN       NaN     NaN   NaN    NaN  103.0  1998-09-09
19    1.0       NaN     NaN   NaN    NaN    NaN  2001-01-11
20    1.0       NaN     NaN   NaN    NaN    NaN  2002-02-02

In [67]:
# we can do relational-style unions (and more)
moreboats = pd.read_json("/Users/mikejcarey/Desktop/teaching/STATS170ab/MoreBoats.json", lines='true')

In [68]:
boats

   bid      bname  color
0  101  Interlake   blue
1  102  Interlake    red
2  103    Clipper  green
3  104     Marine    red

In [69]:
moreboats

   bid    bname  color
0  201  Sunfish   blue
1  202  Sunfish    red
2  203    Yacht  green
3  204    Barge    red

In [70]:
pd.concat([boats, moreboats])

   bid      bname  color
0  101  Interlake   blue
1  102  Interlake    red
2  103    Clipper  green
3  104     Marine    red
0  201    Sunfish   blue
1  202    Sunfish    red
2  203      Yacht  green
3  204      Barge    red

In [71]:
pd.concat([boats, moreboats], ignore_index=True)

   bid      bname  color
0  101  Interlake   blue
1  102  Interlake    red
2  103    Clipper  green
3  104     Marine    red
4  201    Sunfish   blue
5  202    Sunfish    red
6  203      Yacht  green
7  204      Barge    red

In [72]:
pd.concat([boats, moreboats], axis=1)

   bid      bname  color  bid    bname  color
0  101  Interlake   blue  201  Sunfish   blue
1  102  Interlake    red  202  Sunfish    red
2  103    Clipper  green  203    Yacht  green
3  104     Marine    red  204    Barge    red

In [73]:
# to be continued...